Revit 2027 API
RebarConstraintsManager.HasValidRebar Method
 Checks whether the Manager's Rebar is still valid.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValidRebar()
Public Function HasValidRebar As Boolean
public:
bool HasValidRebar()
member HasValidRebar : unit -> bool
Return Value
Boolean
See Also
Reference
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace